# ถ้าฉันมีเงินมากกว่าหรือเท่ากับ 1000 แสดงว่า ฉันรวย
# แต่ถ้าฉันมีเงืนน้อยกว่า 1000 แต่มากกว่าหรือเท่ากับ 500 แสดงว่า ฉันฐานะปานกลาง
# ถ้าไม่ใช่ฉันจน

# money= 300
# if money >= 1000:
#         print('ฉันรวย')
# elif money < 1000 and money >= 500:
#     print("ฉันฐานะปานกลาง")
# else :
#     print('ฉันจน')

# โปรแกรมคำนวณเกรดของนักเรียน
# คะแนน มากกว่าหรือเท่ากับ 80 จะได้เกรด 4 (คะแนน 80 - 100)
# คะแนน มากกว่าหรือเท่ากับ 70 แต่น้อยกว่า 80 จะได้เกรด 3 (คะแนน 70- 79.9999)
# คะแนน มากกว่าหรือเท่ากับ 60 แต่น้อยกว่า 70 จะได้เกรด 2 (คะแนน 60 -69.9999)
# คะแนน มากกว่าหรือเท่ากับ 50 แต่น้อยกว่า 60 จะได้เกรด 1
# ต่ำกว่า 50 แสดงว่าสอบไม่ผ่าน (ต่ำกว่า 50)

# score = int(input("กรอกคะแนนของคุณ: "))
# if score >= 80:
#     print("เกรด 4")
# elif score >= 70 and score < 80:
#     print("เกรด 3")
# elif score >= 60 and score < 70:
#     print("เกรด 2")
# elif score >= 50 and score < 60:
#     print("เกลด 1")
# else :
#     print("ไม่ผ่าน")    


# ให้ผู้ใช้พิมพ์ชื่อตัวเองเข้ามา แล้วแสดงข้อความว่า "Hello ชื่อผู้ใช้ที่กรอกเข้ามาตอนแรก"
# 1.สร้างตัวแปรมาเก็บชื่อผู้ใช้ที่เวลาพิมพ์เข้ามา // What is your name?: Flok
# 2. print("hello ....")  // hello flok
score = input("คุณชื่ออะไร: ")
print("Hello {}".format(score))